src/Reports/ОтчётПоИзменениямВСпецификации/ОтчётПоИзменениямВСпецификации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ОтчётПоИзменениямВСпецификации</name>
  <attributes>
    <name>Период</name>
    <type>
      <types>StandardPeriod</types>
    </type>
  </attributes>
  <attributes>
    <name>Спецификация</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>ВсяСпецификация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Report>

src/InformationRegisters/АналогиНормРасходов/АналогиНормРасходов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>АналогиНормРасходов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Норма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Владелец</name>
    <type>
      <types>CatalogRef.НормыРасходов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>АналогНормыРасходов</name>
    <type>
      <types>CatalogRef.АналогиНормРасходов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/НормыРасходов/НормыРасходов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НормыРасходов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Норма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Владелец</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.Материалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Элемент</name>
    <type>
      <types>CatalogRef.ТехОснастка</types>
      <types>CatalogRef.Документация</types>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.ТехОперации</types>
      <types>CatalogRef.Материалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НормаРасходов</name>
    <type>
      <types>CatalogRef.АналогиНормРасходов</types>
      <types>CatalogRef.НормыРасходов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Catalogs/АналогиНормРасходов/АналогиНормРасходов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>АналогиНормРасходов</name>
  <owners>Catalog.НормыРасходов</owners>
  <attributes>
    <name>ID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Приоритет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидЭлемента</name>
    <type>
      <types>EnumRef.ВидыЭлементовНормРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>Элемент</name>
    <type>
      <types>CatalogRef.ТехОснастка</types>
      <types>CatalogRef.Документация</types>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.ТехОперации</types>
      <types>CatalogRef.Материалы</types>
    </type>
  </attributes>
  <attributes>
    <name>ОграниченноеИспользование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/Catalogs/НормыРасходов/НормыРасходов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>НормыРасходов</name>
  <owners>Catalog.Номенклатура</owners>
  <owners>Catalog.Материалы</owners>
  <attributes>
    <name>ID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидЭлемента</name>
    <type>
      <types>EnumRef.ВидыЭлементовНормРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>Элемент</name>
    <type>
      <types>CatalogRef.ТехОснастка</types>
      <types>CatalogRef.Документация</types>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.ТехОперации</types>
      <types>CatalogRef.Материалы</types>
    </type>
  </attributes>
  <attributes>
    <name>Позиция</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Корневой</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Reports/ОтчётПоИзменениямВСпецификации/Forms/ФормаОтчета/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
Отчет.ВсяСпецификация = Истина;
	Если Параметры.Свойство("Спецификация") Тогда
	Отчет.Спецификация = Параметры.Спецификация;
	ЭтаФорма.Заголовок = "Спецификация "+СокрЛП(Отчет.Спецификация.Наименование);
	СформироватьНаСервере();
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
КлючУникальности = Новый УникальныйИдентификатор();
КонецПроцедуры

&НаСервере
Процедура ВывестиАналоги(НормаРасхода)
ОбъектЗн = РеквизитФормыВЗначение("Отчет");
Макет = ОбъектЗн.ПолучитьМакет("Макет");

ОблАналог = Макет.ПолучитьОбласть("Аналог");
	
ТабДок.НачатьГруппуСтрок("Аналоги",Истина);
АналогиНормРасх = Справочники.АналогиНормРасходов.Выбрать(,НормаРасхода);
	Пока АналогиНормРасх.Следующий() Цикл
	НормыАНР = РегистрыСведений.АналогиНормРасходов.Выбрать(,,Новый Структура("АналогНормыРасходов",АналогиНормРасх.Ссылка));
	ДатаС = "";
	ДатаПо = "";
	Количество = 0;	
		Пока НормыАНР.Следующий() Цикл
			Если НормыАНР.Норма > 0 Тогда
			ДатаС = НормыАНР.Период;
			Количество = НормыАНР.Норма;
			Иначе
	        ДатаПо = НормыАНР.Период;
			КонецЕсли;
		КонецЦикла;
	ОблАналог.Параметры.Статус = ПолучитьСтатус(АналогиНормРасх.Элемент);
	ОблАналог.Параметры.ОграниченноеИспользование = ?(АналогиНормРасх.ОграниченноеИспользование,"+","");
	ОблАналог.Параметры.Наименование = СокрЛП(АналогиНормРасх.Элемент.Наименование);
	ОблАналог.Параметры.МПЗ = АналогиНормРасх.Элемент;
	ОблАналог.Параметры.ДатаС = Формат(ДатаС,"ДФ=dd.MM.yyyy");
	ОблАналог.Параметры.ДатаПо = Формат(ДатаПо,"ДФ=dd.MM.yyyy");
	ОблАналог.Параметры.Количество = Количество;
	ОблАналог.Параметры.ЕдиницаИзмерения = СокрЛП(АналогиНормРасх.Элемент.ОсновнаяЕдиницаИзмерения.Наименование);
	ТекОбл = ТабДок.Вывести(ОблАналог);
		Если ЗначениеЗаполнено(ДатаПо) Тогда
		ТабДок.Область(ТекОбл.Верх, 4, ТекОбл.Низ, 8).ЦветТекста = WebЦвета.Красный;
		ТабДок.Область(ТекОбл.Верх, 4, ТекОбл.Низ, 4).Шрифт = Новый Шрифт(,,,,,Истина);
		КонецЕсли; 
	КонецЦикла; 
ТабДок.ЗакончитьГруппуСтрок();
КонецПроцедуры

&НаСервере
Процедура РаскрытьНаМПЗ(ЭтапСпецификации,Позиция,Количество,ДатаС,ДатаПо)
ОбъектЗн = РеквизитФормыВЗначение("Отчет");
Макет = ОбъектЗн.ПолучитьМакет("Макет");

ОблЭтап = Макет.ПолучитьОбласть("Этап");
ОблМПЗ = Макет.ПолучитьОбласть("МПЗ");

ОблЭтап.Параметры.Наименование = СокрЛП(ЭтапСпецификации.Наименование);
ОблЭтап.Параметры.Статус = ПолучитьСтатус(ЭтапСпецификации);
ОблЭтап.Параметры.ЭтапСпецификации = ЭтапСпецификации;
ОблЭтап.Параметры.ДатаС = Формат(ДатаС,"ДФ=dd.MM.yyyy");
	Если ЗначениеЗаполнено(ДатаПо) Тогда
	ОблЭтап.Параметры.ДатаПо = Формат(ДатаПо,"ДФ=dd.MM.yyyy");
	КонецЕсли; 
ОблЭтап.Параметры.Количество = Количество;
ОблЭтап.Параметры.ЕдиницаИзмерения = СокрЛП(ЭтапСпецификации.ОсновнаяЕдиницаИзмерения.Наименование);
ТабДок.Вывести(ОблЭтап); 
ТабДок.НачатьГруппуСтрок("Этап спецификации",Истина);

Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	НормыРасходов.Элемент,
	|	НормыРасходов.Ссылка,
	|	НормыРасходов.Позиция
	|ИЗ
	|	Справочник.НормыРасходов КАК НормыРасходов
	|ГДЕ
	|	НормыРасходов.Владелец = &Владелец
	|
	|УПОРЯДОЧИТЬ ПО
	|	НормыРасходов.Позиция,
	|	НормыРасходов.Элемент.Наименование";
Запрос.УстановитьПараметр("Владелец", ЭтапСпецификации);
РезультатЗапроса = Запрос.Выполнить();
НормРасх = РезультатЗапроса.Выбрать();
	Пока НормРасх.Следующий() Цикл 
		Если ТипЗнч(НормРасх.Элемент) = Тип("СправочникСсылка.Номенклатура") Тогда
		Нормы = РегистрыСведений.НормыРасходов.Выбрать(,,Новый Структура("НормаРасходов",НормРасх.Ссылка));
		ДатаС = "";
		ДатаПо = "";
		Количество = 0;
			Пока Нормы.Следующий() Цикл
				Если Нормы.Норма > 0 Тогда
				ДатаС = Нормы.Период;
				Количество = Нормы.Норма;
				Иначе
		        ДатаПо = Нормы.Период;
				КонецЕсли;  
			КонецЦикла;
				Если Отчет.ВсяСпецификация Тогда
					Если ЗначениеЗаполнено(ДатаПо) Тогда
					ОблЭтап.Параметры.Наименование = СокрЛП(НормРасх.Элемент.Наименование);
					ОблЭтап.Параметры.Статус = ПолучитьСтатус(НормРасх.Элемент);
					ОблЭтап.Параметры.ЭтапСпецификации = НормРасх.Элемент;
					ОблЭтап.Параметры.ДатаС = Формат(ДатаС,"ДФ=dd.MM.yyyy");
					ОблЭтап.Параметры.ДатаПо = Формат(ДатаПо,"ДФ=dd.MM.yyyy");
					ОблЭтап.Параметры.Количество = Количество;
					ОблЭтап.Параметры.ЕдиницаИзмерения = СокрЛП(НормРасх.Элемент.ОсновнаяЕдиницаИзмерения.Наименование);
					ТекОбл = ТабДок.Вывести(ОблЭтап);
					ТабДок.Область(ТекОбл.Верх, 4, ТекОбл.Низ, 8).ЦветТекста = WebЦвета.Красный;
					ТабДок.Область(ТекОбл.Верх, 4, ТекОбл.Низ, 4).Шрифт = Новый Шрифт(,,,,,Истина);
					ВывестиАналоги(НормРасх.Ссылка);
					Иначе
					РаскрытьНаМПЗ(НормРасх.Элемент,НормРасх.Позиция,Количество,ДатаС,ДатаПо);
					КонецЕсли;
				Иначе
				ОблЭтап.Параметры.Наименование = СокрЛП(НормРасх.Элемент.Наименование);
				ОблЭтап.Параметры.Статус = ПолучитьСтатус(НормРасх.Элемент);
				ОблЭтап.Параметры.ЭтапСпецификации = НормРасх.Элемент;
				ОблЭтап.Параметры.ДатаС = Формат(ДатаС,"ДФ=dd.MM.yyyy");
				ОблЭтап.Параметры.ДатаПо = Формат(ДатаПо,"ДФ=dd.MM.yyyy");
				ОблЭтап.Параметры.Количество = Количество;
				ОблЭтап.Параметры.ЕдиницаИзмерения = СокрЛП(НормРасх.Элемент.ОсновнаяЕдиницаИзмерения.Наименование);
				ТекОбл = ТабДок.Вывести(ОблЭтап);
					Если ЗначениеЗаполнено(ДатаПо) Тогда
					ТабДок.Область(ТекОбл.Верх, 4, ТекОбл.Низ, 8).ЦветТекста = WebЦвета.Красный;
					ТабДок.Область(ТекОбл.Верх, 4, ТекОбл.Низ, 4).Шрифт = Новый Шрифт(,,,,,Истина);
					КонецЕсли;
				ВывестиАналоги(НормРасх.Ссылка);
				КонецЕсли;
		Иначе
		Нормы = РегистрыСведений.НормыРасходов.Выбрать(,,Новый Структура("НормаРасходов",НормРасх.Ссылка));
		ДатаС = "";
		ДатаПо = "";
		Количество = 0;	
			Пока Нормы.Следующий() Цикл
				Если Нормы.Норма > 0 Тогда
				ДатаС = Нормы.Период;
				Количество = Нормы.Норма;
				Иначе
		        ДатаПо = Нормы.Период;
				КонецЕсли;
			КонецЦикла;
		ОблМПЗ.Параметры.Статус = ПолучитьСтатус(НормРасх.Элемент);
		ОблМПЗ.Параметры.ПозОбозн = СокрЛП(НормРасх.Позиция);
		ОблМПЗ.Параметры.Наименование = СокрЛП(НормРасх.Элемент.Наименование);
		ОблМПЗ.Параметры.МПЗ = НормРасх.Элемент;
		ОблМПЗ.Параметры.ДатаС = Формат(ДатаС,"ДФ=dd.MM.yyyy");
		ОблМПЗ.Параметры.ДатаПо = Формат(ДатаПо,"ДФ=dd.MM.yyyy");
		ОблМПЗ.Параметры.Количество = Количество;
			Если ТипЗнч(НормРасх.Элемент) = Тип("СправочникСсылка.Материалы") Тогда
			ОблМПЗ.Параметры.ЕдиницаИзмерения = СокрЛП(НормРасх.Элемент.ОсновнаяЕдиницаИзмерения.Наименование);
			Иначе
			ОблМПЗ.Параметры.ЕдиницаИзмерения = ""; 
			КонецЕсли; 	
		ТекОбл = ТабДок.Вывести(ОблМПЗ);
			Если ЗначениеЗаполнено(ДатаПо) Тогда
			ТабДок.Область(ТекОбл.Верх, 4, ТекОбл.Низ, 8).ЦветТекста = WebЦвета.Красный;
			ТабДок.Область(ТекОбл.Верх, 4, ТекОбл.Низ, 4).Шрифт = Новый Шрифт(,,,,,Истина);
			КонецЕсли;  
				Если ТипЗнч(НормРасх.Элемент) = Тип("СправочникСсылка.Материалы") Тогда
				ВывестиАналоги(НормРасх.Ссылка);
				ИначеЕсли ТипЗнч(НормРасх.Элемент) = Тип("СправочникСсылка.Документация") Тогда
	            ТабДок.Область(ТекОбл.Верх, 1, ТекОбл.Низ, 8).ЦветТекста = WebЦвета.Синий;
				ИначеЕсли ТипЗнч(НормРасх.Элемент) = Тип("СправочникСсылка.ТехОперации") Тогда
	            ТабДок.Область(ТекОбл.Верх, 1, ТекОбл.Низ, 8).ЦветТекста = WebЦвета.Коричневый;
				ИначеЕсли ТипЗнч(НормРасх.Элемент) = Тип("СправочникСсылка.ТехОснастка") Тогда
	            ТабДок.Область(ТекОбл.Верх, 1, ТекОбл.Низ, 8).ЦветТекста = WebЦвета.Коричневый;
				КонецЕсли;
					Если ЗначениеЗаполнено(ДатаПо) Тогда
					ТабДок.Область(ТекОбл.Верх, 4, ТекОбл.Низ, 8).ЦветТекста = WebЦвета.Красный;
					ТабДок.Область(ТекОбл.Верх, 4, ТекОбл.Низ, 4).Шрифт = Новый Шрифт(,,,,,Истина);
					КонецЕсли; 
		КонецЕсли;
	КонецЦикла;
ТабДок.ЗакончитьГруппуСтрок();	
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере()
ТабДок.Очистить();

ОбъектЗн = РеквизитФормыВЗначение("Отчет");
Макет = ОбъектЗн.ПолучитьМакет("Макет");

ОблШапка = Макет.ПолучитьОбласть("Шапка");	
ОблКонец = Макет.ПолучитьОбласть("Конец");

ТабДок.Вывести(ОблШапка);
ДатаС = Отчет.Спецификация.ДатаСозданияСпецификации;
РаскрытьНаМПЗ(Отчет.Спецификация,"",1,ДатаС,"");
ТабДок.Вывести(ОблКонец);
ТабДок.ФиксацияСверху = 2;
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	Если ЭтаФорма.ПроверитьЗаполнение() Тогда
	ЭтаФорма.Заголовок = "Спецификация "+СокрЛП(Отчет.Спецификация);
	СформироватьНаСервере();
	КонецЕсли; 
КонецПроцедуры
